<template>
    <div class="bg-beige-50 dark:bg-gray-900 min-h-screen text-slate dark:text-beige-100 overflow-x-hidden">
        <BlobsBg />
        <AdaptiveContainer class="p-0!">
            <main class="px-6">
                
                <!-- Записка самому себе. Отрефактори заголовки в каждой секции на нужную компоненту -->
                <!-- И вынеси все данные в data -->

                <!-- Заголовок -->
                <DocsHero />

                <!-- Факты -->
                <DocsFacts />

                <!-- Пресс центр -->
                <DocsPress />

                <!-- Документы проекта -->
                <DocsDocuments />

                <!-- Сотрудничество -->
                <DocsPartners />

                <!-- Идентификация -->
                <DocsBadges />

                <!-- FAQ -->
                <DocsFaq />

                <!-- Контакты -->
                <AdminContacts/>

            </main>
        </AdaptiveContainer>
    </div>
</template>

<script setup lang="ts">
import { ref } from 'vue'


const openMediaFaq = ref<number | null>(null)


const mediaFaq = [
    {
        q: 'FreshCheck зарегистрирован как юрлицо или НКО?',
        a: 'Нет. Проект не зарегистрирован как юридическое лицо, индивидуальный предприниматель, некоммерческая организация или общественное объединение. Все участники действуют как граждане РФ на правах обычных потребителей.'
    },
    {
        q: 'Можно ли использовать материалы проекта в СМИ?',
        a: 'Да. Любой желающий вправе использовать информацию и тексты публикаций на своих ресурсах при условии сохранения ссылки на источник. При цитировании материалов СМИ мы руководствуемся ст. 1274 ГК РФ.'
    },
    {
        q: 'Влияет ли партнёрство на ваши оценки магазинов?',
        a: 'Нет. Партнёрство не влияет на объективность наших оценок.'
    },
    {
        q: 'Как проверить, что участник действительно из FreshCheck?',
        a: 'Каждый участник имеет бейдж с уникальным кодом формата #[ТИП][НОМЕР]-AST[БУКВА].'
    }
]
</script>

<style>
html {
    scroll-behavior: smooth;
}
</style>